import { FunctionComponent } from 'react';
import TeacherMainItem from '@components/teacher-main/teacher-main-item/TeacherMainItem';
const items = [
  {
    id: 1,
    title: 'Блок 1',
    imgSrc: '/teacher.jpg',
    text: 'А также явные признаки победы институционализации призывают нас к новым свершениям, которые, в свою очередь, должны быть обнародованы. Противоположная точка зрения подразумевает, что интерактивные прототипы призывают нас к новым свершениям, которые, в свою очередь, должны быть призваны к ответу. Сложно сказать, почему сторонники тоталитаризма в науке являются только методом политического участия и в равной степени предоставлены сами себе. ',
  },
  {
    id: 1,
    title: 'Блок 2',
    imgSrc: '/teacher.jpg',
    text: 'А также явные признаки победы институционализации призывают нас к новым свершениям, которые, в свою очередь, должны быть обнародованы. Противоположная точка зрения подразумевает, что интерактивные прототипы призывают нас к новым свершениям, которые, в свою очередь, должны быть призваны к ответу. Сложно сказать, почему сторонники тоталитаризма в науке являются только методом политического участия и в равной степени предоставлены сами себе. ',
  },
  {
    id: 1,
    title: 'Блок 3',
    imgSrc: '/avatar.jpg',
    text: 'А также явные признаки победы институционализации призывают нас к новым свершениям, которые, в свою очередь, должны быть обнародованы. Противоположная точка зрения подразумевает, что интерактивные прототипы призывают нас к новым свершениям, которые, в свою очередь, должны быть призваны к ответу. Сложно сказать, почему сторонники тоталитаризма в науке являются только методом политического участия и в равной степени предоставлены сами себе. ',
  },
];

const TeacherMain: FunctionComponent = () => {
  return (
    <div>
      {items.map((item) => {
        return <TeacherMainItem key={item.id} title={item.title} text={item.text} imgSrc={item.imgSrc} />;
      })}
    </div>
  );
};

export default TeacherMain;
